{
  "title": "Milzull Service Agreement & Terms of Use",
  "lastUpdated": "2026-01-10",
  "sections": [
    {
      "heading": "1. What Milzull Is",
      "points": [
        "Milzull is a peer-to-peer social connection platform.",
        "It helps users discover people for activities such as coffee, travel, movies, walks, and other social meetups.",
        "It enables companionship, friendship, and conversations.",
        "Milzull does not arrange, supervise, or participate in user interactions.",
        "Milzull only provides the technology platform to enable discovery and communication."
      ]
    },
    {
      "heading": "2. User Responsibility & Risk Acceptance",
      "points": [
        "All interactions on Milzull are voluntary.",
        "All meetings occur entirely at your own risk.",
        "Milzull cannot guarantee the safety, intent, or behavior of any user.",
        "You are solely responsible for your actions both online and offline.",
        "Milzull shall not be responsible for physical harm or injury.",
        "Milzull shall not be responsible for emotional distress.",
        "Milzull shall not be responsible for harassment or misconduct.",
        "Milzull shall not be responsible for financial loss or fraud.",
        "Milzull shall not be responsible for disputes between users."
      ]
    },
    {
      "heading": "3. Age & Eligibility",
      "points": [
        "You must be 18 years of age or older to use Milzull.",
        "You must provide truthful, accurate, and complete identity information.",
        "Fake profiles, impersonation, or misrepresentation will result in permanent account ban."
      ]
    },
    {
      "heading": "4. Code of Conduct",
      "points": [
        "You must behave respectfully toward all users.",
        "You must not harass, stalk, threaten, or abuse others.",
        "You must not use hate speech, discriminatory language, or promote violence.",
        "You must not mislead users with false intentions.",
        "You must not pressure users into meetings or sharing personal details.",
        "You must not engage in scams, fraud, or financial solicitation.",
        "You must not share explicit, pornographic, or offensive content.",
        "Violations may lead to immediate suspension or permanent termination."
      ]
    },
    {
      "heading": "5. Meetings & Safety Disclaimer",
      "points": [
        "Milzull does not recommend or enforce in-person meetings.",
        "If users choose to meet, they should meet in public places.",
        "Users should inform someone they trust before meeting.",
        "Users should not share sensitive personal or financial information.",
        "Milzull is not liable for incidents occurring before, during, or after meetups."
      ]
    },
    {
      "heading": "6. Content & Profile Rules",
      "points": [
        "Users may not post explicit sexual content.",
        "Users may not post violent or disturbing material.",
        "Users may not share someone else’s private information.",
        "Users may not upload fake or manipulated photos.",
        "Users may not post content violating intellectual property laws.",
        "Milzull reserves the right to remove content without prior notice."
      ]
    },
    {
      "heading": "7. Identity & Verification",
      "points": [
        "Verification may be requested to improve trust and safety.",
        "Verification does not guarantee user behavior or intent.",
        "Milzull does not conduct criminal background checks."
      ]
    },
    {
      "heading": "8. Financial Safety",
      "points": [
        "Users must not share bank details, OTPs, or passwords.",
        "Requests for money, investments, or financial assistance are prohibited.",
        "Milzull is not responsible for financial loss caused by other users."
      ]
    },
    {
      "heading": "9. Data & Privacy",
      "points": [
        "Users must not scrape, harvest, or misuse platform data.",
        "Data is handled in accordance with India’s Digital Personal Data Protection (DPDP) Act.",
        "Data is handled in accordance with the Information Technology Act, 2000.",
        "Users are responsible for the information they choose to share."
      ]
    },
    {
      "heading": "10. Content License",
      "points": [
        "By posting content, you grant Milzull a non-exclusive, royalty-free license.",
        "This license allows Milzull to store, display, and use content for platform operation and safety."
      ]
    },
    {
      "heading": "11. Account Termination",
      "points": [
        "Milzull may suspend or terminate accounts.",
        "Milzull may restrict access to the platform.",
        "Milzull may remove content without prior notice.",
        "Such actions may occur if platform integrity or user safety is at risk."
      ]
    },
    {
      "heading": "12. Limitation of Liability",
      "points": [
        "Milzull provides the platform on an \"as is\" basis.",
        "Milzull is not liable for user actions.",
        "Milzull is not liable for offline incidents.",
        "Milzull is not liable for missed connections.",
        "Milzull is not liable for emotional or physical harm.",
        "Milzull is not liable for service interruptions."
      ]
    },
    {
      "heading": "13. Changes to Terms",
      "points": [
        "Milzull may update these Terms at any time.",
        "Continued use of the platform implies acceptance of updated Terms."
      ]
    },
    {
      "heading": "14. Governing Law",
      "points": [
        "These Terms are governed by the laws of India.",
        "Courts in India shall have exclusive jurisdiction."
      ]
    },
    {
      "heading": "15. Acceptance",
      "points": [
        "By clicking \"I Agree & Continue\", you confirm that you understand Milzull’s purpose.",
        "You accept all associated risks.",
        "You agree to these Terms permanently."
      ]
    }
  ]
}
